app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-15 14:03:26.424982"], ["text", "eza"], ["title", "eza"], ["updated_at", "2014-07-15 14:03:26.424982"]]
---
	def create
		@article = Article.new(article_params)
		if @article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "text" = ?, "title" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["text", "ezaezaezaeza"], ["title", "ezaeezaezaeza"], ["updated_at", "2014-07-15 15:56:50.897267"]]
---
	def update
		@article = Article.find(params[:id])
		if @article.update(article_params)